In [2]:
#How to make a one-dimensional labeled array its name is Series
import pandas as pd

# Creating a Series from a list
series = pd.Series([10, 20, 30, 40, 50])
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [2]:
#**data

In [3]:
#How to make a two-dimensional  labeled array its name is Dataframe
data = {
    'apples': [3, 2, 0, 1],
    'oranges': [0, 3, 7, 2]
}

df = pd.DataFrame(data)
print(df)

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [34]:
data = {'Name':['Alice','Bob','Charlie'],
        'Age':[25,30,35],
        'City':['New York','Los Angeles','Chicago']}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [35]:
# Display the first 5 rows of the DataFrame
df.head()

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [36]:
# Display summary information about the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [37]:
# Generate descriptive statistics for numerical columns
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

# Selecting and Filtering Data

In [38]:
# Select a single column
df['Name']

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [39]:
# Filter rows where 'Age' > 30
filtered_df = df[df['Age'] > 30]
print(filtered_df)

      Name  Age     City
2  Charlie   35  Chicago

In [40]:
# Select specific rows and columns using loc[]
selected_data = df.loc[[0, 1], ['Name','City']]
print(selected_data)

    Name         City
0  Alice     New York
1    Bob  Los Angeles

In [41]:
# Select specific rows and columns using iloc[Row_position,coulmn_position]
selected_data = df.iloc[0:3 ,[0,1,2]]
print(selected_data)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

# Modifying Data

In [42]:
# Add a new column 'Salary'
df['Salary'] = [60000, 70000, 80000]
print(df)

      Name  Age         City  Salary
0    Alice   25     New York   60000
1      Bob   30  Los Angeles   70000
2  Charlie   35      Chicago   80000

In [43]:
# Update 'Salary' column by adding 1000 to each value
df['Salary'] = df['Salary'] + 1000
print(df)

      Name  Age         City  Salary
0    Alice   25     New York   61000
1      Bob   30  Los Angeles   71000
2  Charlie   35      Chicago   81000

In [45]:
# Update 'age' column by adding 5 to each value
df['Age'] = df['Age'] + 5
print(df)

      Name  Age         City  Salary
0    Alice   35     New York   61000
1      Bob   40  Los Angeles   71000
2  Charlie   45      Chicago   81000

In [46]:
# Drop the 'Salary' column
df = df.drop('Salary', axis=1)
print(df)

      Name  Age         City
0    Alice   35     New York
1      Bob   40  Los Angeles
2  Charlie   45      Chicago

In [47]:
# Drop the 'index 1' row
df = df.drop(1, axis=0)
print(df)

      Name  Age      City
0    Alice   35  New York
2  Charlie   45   Chicago

# Handling Missing Data

In [58]:
df_with_nan = pd.DataFrame ({'A':[1,2,None],'B':[4,None,6]})
print(df_with_nan)

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  6.0

In [57]:
# Detect missing values
df_with_nan = pd.DataFrame ({'A':[1,2,None],'B':[4,None,6]})
print(df_with_nan.isnull())

       A      B
0  False  False
1  False   True
2   True  False

In [61]:
# Detect missing values
df_with_nan.isna()

       A      B
0  False  False
1  False   True
2   True  False

In [64]:
#Detect total missing values in each coulmn 
df_with_nan.isnull().sum()

A    1
B    1
dtype: int64

In [67]:
#Detect total missing values in all dataframe 
df_with_nan.isnull().sum().sum()

2

In [68]:
# Fill missing values with 0
filled_df = df_with_nan.fillna(0)
print(filled_df)

     A    B
0  1.0  4.0
1  2.0  0.0
2  0.0  6.0

In [69]:
# Drop rows with missing values
df_with_nan.dropna()

     A    B
0  1.0  4.0

In [72]:
df_with_nan.dropna(axis =1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

# Grouping and Aggregation

In [81]:
df = pd.DataFrame({'Department': ['HR', 'IT', 'HR', 'IT'],
                'Salary': [50000, 60000, 45000, 80000]})
print(df)

  Department  Salary
0         HR   50000
1         IT   60000
2         HR   45000
3         IT   80000

In [82]:
def double_salary(x):
    return x * 2

df['Double Salary'] = df['Salary'].apply(double_salary)
print(df)

  Department  Salary  Double Salary
0         HR   50000         100000
1         IT   60000         120000
2         HR   45000          90000
3         IT   80000         160000

In [83]:
# Group data by 'Department' and calculate mean salary
df.groupby('Department')['Salary'].mean()

Department
HR    47500.0
IT    70000.0
Name: Salary, dtype: float64

 # Practical Examples

In [135]:
# Load the CSV file into a Pandas DataFrame
df =pd.read_csv("Grades_Short.csv")

In [136]:
# Display the first 5 rows of the DataFrame
df.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,90743
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A,7284
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-,7625
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A,1237
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62

In [138]:
#dimension of DF
df.shape

(7, 10)

In [139]:
#How each column is stored
df.dtypes

Name               object
Previous_Part     float64
Participation1      int64
Mini_Exam1        float64
Mini_Exam2          int64
Participation2      int64
Mini_Exam3        float64
Final             float64
Grade              object
ID                  int64
dtype: object

In [141]:
#get column names
df.columns

Index(['Name', 'Previous_Part', 'Participation1', 'Mini_Exam1', 'Mini_Exam2',
       'Participation2', 'Mini_Exam3', 'Final', 'Grade', 'ID'],
      dtype='object')

In [142]:
#Get row names
df.index

RangeIndex(start=0, stop=7, step=1)

In [146]:
#Get Name column
names = df['Name']
names

0     Jake
1      Joe
2    Susan
3      Sol
4    Chris
5    Tarik
6    Malik
Name: Name, dtype: object

In [144]:
#get Name Column but not preferred
df.Name

0     Jake
1      Joe
2    Susan
3      Sol
4    Chris
5    Tarik
6    Malik
Name: Name, dtype: object

In [145]:
#Select multiple columns
df[["Name","Grade"]]

    Name Grade
0   Jake     A
1    Joe     A
2  Susan    A-
3    Sol     A
4  Chris     A
5  Tarik     B
6  Malik     A

In [148]:
names[0]

'Jake'

In [149]:
names[1:4]

1      Joe
2    Susan
3      Sol
Name: Name, dtype: object

In [150]:
names[[1,2,4]]

1      Joe
2    Susan
4    Chris
Name: Name, dtype: object

In [153]:
#Slicing DataFrame
first_name = df.loc[0,"Name"]
first_name

'Jake'

In [155]:
#slicing entire row
first_row = df.loc[0,:]
first_row

Name               Jake
Previous_Part      32.0
Participation1        1
Mini_Exam1         19.5
Mini_Exam2           20
Participation2        1
Mini_Exam3         10.0
Final              33.0
Grade                 A
ID                90743
Name: 0, dtype: object

In [158]:
#pick out contiguous chunk row from 0 to 2 column from name to mini_exam
slice_one = df.loc[0:2,"Name":"Mini_Exam2"]
slice_one

    Name  Previous_Part  Participation1  Mini_Exam1  Mini_Exam2
0   Jake           32.0               1        19.5          20
1    Joe           32.0               1        20.0          16
2  Susan           30.0               1        19.0          19

In [159]:
#pick out row 0,2 and 3 column name and Grade
slice_two = df.loc[[0,2,3],["Name","Grade"]]
slice_two

    Name Grade
0   Jake     A
2  Susan    A-
3    Sol     A

In [162]:
#build in function calculate mean for Final column
avg_final = df.Final.mean()
avg_final

32.214285714285715

In [163]:
#build in function print max value
max_mini_1 = df["Mini_Exam1"].max()
max_mini_1

22.0

In [165]:
# Generate descriptive statistics for numerical columns
df.describe()

,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,ID
count,7.000000,7.0,7.000000,7.000000,7.0,7.000000,7.000000,7.00000
mean,31.071429,1.0,19.785714,17.857143,1.0,11.000000,32.214286,29111.00000
std,0.838082,0.0,1.074598,2.734262,0.0,2.217356,3.828154,41131.08167
min,30.000000,1.0,19.000000,13.000000,1.0,8.000000,24.000000,62.00000
25%,30.500000,1.0,19.000000,16.500000,1.0,9.500000,32.500000,4260.50000
50%,31.000000,1.0,19.500000,19.000000,1.0,10.500000,33.000000,7625.00000
75%,31.750000,1.0,20.000000,19.500000,1.0,12.750000,33.750000,48413.00000
max,32.000000,1.0,22.000000,21.000000,1.0,14.000000,36.000000,90743.00000

In [168]:
#build in function print unique and its count
df["Grade"].value_counts()

Grade
A     5
A-    1
B     1
Name: count, dtype: int64

In [169]:
#Returns all the unique values.
df["Grade"].unique()

array(['A', 'A-', 'B'], dtype=object)

In [174]:
#create column from another column
df["Final_percentage"] = df["Final"]/36
df.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID,Final_percentage
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,90743,0.916667
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A,7284,0.888889
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-,7625,0.916667
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A,1237,0.944444
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62,0.930556

In [175]:
#delete coulmn
del df["Final_percentage"]
df.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,90743
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A,7284
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-,7625
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A,1237
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62

In [176]:
#delete multiple column
df.drop(["ID","Participation1"],axis=1,inplace = True)
df.head()

,Name,Previous_Part,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade
0,Jake,32.0,19.5,20,1,10.0,33.0,A
1,Joe,32.0,20.0,16,1,14.0,32.0,A
2,Susan,30.0,19.0,19,1,10.5,33.0,A-
3,Sol,31.0,22.0,13,1,13.0,34.0,A
4,Chris,30.0,19.0,17,1,12.5,33.5,A

In [178]:
df_missing = pd.read_csv("Missing_Data.csv")
df_missing

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,-1
1,Joe,NaN,1,20.0,16,1,14.0,32.0,A,23
2,Sol,31.0,1,22.0,13,1,13.0,34.0,A,34
3,Chris,30.0,-1,19.0,not available,1,12.5,33.5,A,72

In [179]:
df_missing.dtypes

Name               object
Previous_Part     float64
Participation1      int64
Mini_Exam1        float64
Mini_Exam2         object
Participation2      int64
Mini_Exam3        float64
Final             float64
Grade              object
Temp                int64
dtype: object

In [183]:
#replace nan and not available with nan
df_missing = pd.read_csv("Missing_Data.csv", na_values = ["NAN","not available",-1])
df_missing

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1.0,19.5,20.0,1,10.0,33.0,A,NaN
1,Joe,NaN,1.0,20.0,16.0,1,14.0,32.0,A,23.0
2,Sol,31.0,1.0,22.0,13.0,1,13.0,34.0,A,34.0
3,Chris,30.0,NaN,19.0,NaN,1,12.5,33.5,A,72.0

In [184]:
df_missing.isnull()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,False,False,False,False,False,False,False,False,False,True
1,False,True,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,True,False,True,False,False,False,False,False

In [186]:
#Detect total missing values in each coulmn 
df_missing.isnull().sum()

Name              0
Previous_Part     1
Participation1    1
Mini_Exam1        0
Mini_Exam2        1
Participation2    0
Mini_Exam3        0
Final             0
Grade             0
Temp              1
dtype: int64

In [189]:
#inplace false dont save the change 
df_missing.dropna(axis =0,inplace = False)

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
2,Sol,31.0,1.0,22.0,13.0,1,13.0,34.0,A,34.0

In [188]:
df_missing

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1.0,19.5,20.0,1,10.0,33.0,A,NaN
1,Joe,NaN,1.0,20.0,16.0,1,14.0,32.0,A,23.0
2,Sol,31.0,1.0,22.0,13.0,1,13.0,34.0,A,34.0
3,Chris,30.0,NaN,19.0,NaN,1,12.5,33.5,A,72.0